# Lecture 9 Pandas and loops

In [1]:
#setup
import pandas as pd

In [2]:
div_scores_dictionary = {"student_name": ["Jay", "Aaryan", "Sahil","Riya","Shubh"],
                         "math_scores": [20,56,76,78,90],
                         "chemistry_scores": [32,36,78,23,100],
                         "information_technology_scores": [34,6,88,100,45],
                         "physics_scores": [6,88,48,90,25]
                         }


                         
div_emails_dictionary = {"student_name": ["Jay", "Aaryan", "Sahil","Riya","Shubh", "Abdul"],
                           "student_email": ["Jay@gmail.com", "Aaryan@gmail.com", "Sahil@gmail.com","Riya@gmail.com","Shubh@gmail.com", "Abdual@gmail.com"]
                         }

In [3]:
report_database = [
   {
      "class":10,
      "division":"A",
      "teacher":"Zoshua Colah",
      "scores":{
         "student_name":[
            "Jay",
            "Aaryan",
            "Sahil",
            "Riya",
            "Shubh"
         ],
         "math_scores":[
            20,
            56,
            76,
            78,
            90
         ],
         "chemistry_scores":[
            32,
            36,
            78,
            23,
            100
         ],
         "information_technology_scores":[
            34,
            6,
            88,
            100,
            45
         ],
         "physics_scores":[
            6,
            88,
            48,
            90,
            25
         ]
      },
      "emails":{
         "student_name":[
            "Jay",
            "Aaryan",
            "Sahil",
            "Riya",
            "Shubh",
            "Abdul"
         ],
         "student_email":[
            "Jay@gmail.com",
            "Aaryan@gmail.com",
            "Sahil@gmail.com",
            "Riya@gmail.com",
            "Shubh@gmail.com",
            "Abdual@gmail.com"
         ]
      }
   },
   {
      "class":10,
      "division":"B",
      "teacher":"Aayushi Shah",
      "scores":{
         "student_name":[
            "Jai",
            "Aryan",
            "Firoz",
            "Steve",
            "Rhea"
         ],
         "math_scores":[
            32,
            56,
            76,
            78,
            90
         ],
         "chemistry_scores":[
            32,
            56,
            75,
            23,
            10
         ],
         "information_technology_scores":[
            34,
            6,
            48,
            100,
            45
         ],
         "physics_scores":[
            6,
            88,
            58,
            90,
            25
         ]
      },
      "emails":{
         "student_name":[
            "Jai",
            "Aryan",
            "Firoz",
            "Steve",
            "Rhea"
         ],
         "student_email":[
            "Jai@gmail.com",
            "Aryan@gmail.com",
            "Firoz@gmail.com",
            "Steve@gmail.com",
            "Rhea@gmail.com"
         ]
      }
   },
   {
      "class":10,
      "division":"C",
      "teacher":"Rahul Joy",
      "scores":{
         "student_name":[
            "Kareena",
            "Alia",
            "Priyanka",
            "Shahrukh",
            "Salman"
         ],
         "math_scores":[
            22,
            56,
            76,
            78,
            90
         ],
         "chemistry_scores":[
            30,
            56,
            78,
            23,
            100
         ],
         "information_technology_scores":[
            34,
            6,
            98,
            100,
            40
         ],
         "physics_scores":[
            60,
            88,
            58,
            90,
            25
         ]
      },
      "emails":{
         "student_name":[
            "Kareena",
            "Alia",
            "Priyanka",
            "Shahrukh",
            "Salman"
         ],
         "student_email":[
            "Kareena@gmail.com",
            "Alia@gmail.com",
            "Priyanka@gmail.com",
            "Shahrukh@gmail.com",
            "Salman@gmail.com"
         ]
      }
   }
]

In [4]:
report_database

[{'class': 10,
  'division': 'A',
  'teacher': 'Zoshua Colah',
  'scores': {'student_name': ['Jay', 'Aaryan', 'Sahil', 'Riya', 'Shubh'],
   'math_scores': [20, 56, 76, 78, 90],
   'chemistry_scores': [32, 36, 78, 23, 100],
   'information_technology_scores': [34, 6, 88, 100, 45],
   'physics_scores': [6, 88, 48, 90, 25]},
  'emails': {'student_name': ['Jay',
    'Aaryan',
    'Sahil',
    'Riya',
    'Shubh',
    'Abdul'],
   'student_email': ['Jay@gmail.com',
    'Aaryan@gmail.com',
    'Sahil@gmail.com',
    'Riya@gmail.com',
    'Shubh@gmail.com',
    'Abdual@gmail.com']}},
 {'class': 10,
  'division': 'B',
  'teacher': 'Aayushi Shah',
  'scores': {'student_name': ['Jai', 'Aryan', 'Firoz', 'Steve', 'Rhea'],
   'math_scores': [32, 56, 76, 78, 90],
   'chemistry_scores': [32, 56, 75, 23, 10],
   'information_technology_scores': [34, 6, 48, 100, 45],
   'physics_scores': [6, 88, 58, 90, 25]},
  'emails': {'student_name': ['Jai', 'Aryan', 'Firoz', 'Steve', 'Rhea'],
   'student_email': ['Jai@gmail.com',
    'Aryan@gmail.com',
    'Firoz@gmail.com',
    'Steve@gmail.com',
    'Rhea@gmail.com']}},
 {'class': 10,
  'division': 'C',
  'teacher': 'Rahul Joy',
  'scores': {'student_name': ['Kareena',
    'Alia',
    'Priyanka',
    'Shahrukh',
    'Salman'],
   'math_scores': [22, 56, 76, 78, 90],
   'chemistry_scores': [30, 56, 78, 23, 100],
   'information_technology_scores': [34, 6, 98, 100, 40],
   'physics_scores': [60, 88, 58, 90, 25]},
  'emails': {'student_name': ['Kareena',
    'Alia',
    'Priyanka',
    'Shahrukh',
    'Salman'],
   'student_email': ['Kareena@gmail.com',
    'Alia@gmail.com',
    'Priyanka@gmail.com',
    'Shahrukh@gmail.com',
    'Salman@gmail.com']}}]

In [5]:
# Setup
import pandas as pd

In [6]:
# Function to accept a list of reports 
# Returns a mega report dataframe (of all divisions)

def get_report_df(report_list): 
    
    # Create an empty mega report dataframe
    mega_report_df = pd.DataFrame()

    # For Loop
    # For Each Division Dictionary in the Report: 
    #########################################################
    
    for div_dictionary in report_list: 
    
        # Create a Student Scores Dataframe 
        scores_df = pd.DataFrame(div_dictionary["scores"])
        
        # Create an Emails Dataframe
        emails_df = pd.DataFrame(div_dictionary["emails"])
        
        # Merge the two dataframes together
        merged_df = pd.merge(scores_df, emails_df, how = "left", on = ["student_name"])  
        
        # Add a class column
        merged_df["class"] = div_dictionary["class"]
        
        # Add a division column
        merged_df["division"] = div_dictionary["division"]
        
        # Add a teacher column
        merged_df["teacher"] = div_dictionary["teacher"]
        
        # Add this merged dataframe to Mega Report Dataframe
        mega_report_df = pd.concat([mega_report_df, merged_df], ignore_index= True )
        
    #########################################################
    
    # Add the Total Score, Average Score, Pass/Fail, Character Grade Column
    mega_report_df["total_score"] = mega_report_df["physics_scores"] + mega_report_df["chemistry_scores"] + mega_report_df["information_technology_scores"] + mega_report_df["math_scores"]
    mega_report_df["average_score"] = mega_report_df["total_score"]/4

    
    mega_report_df.loc[mega_report_df["average_score"]>=35, "status"] = "pass"
    mega_report_df.loc[mega_report_df["average_score"]<35, "status"] = "fail"
    
    mega_report_df.loc[mega_report_df["average_score"] >= 90, "character_grade"] = "A"
    mega_report_df.loc[(mega_report_df["average_score"] >= 70) &(mega_report_df["average_score"] <90), "character_grade"] = "B"
    mega_report_df.loc[(mega_report_df["average_score"] >= 50) &(mega_report_df["average_score"] <70), "character_grade"] = "C"
    mega_report_df.loc[(mega_report_df["average_score"] >= 35) &(mega_report_df["average_score"] <50), "character_grade"] = "D"
    mega_report_df.loc[mega_report_df["average_score"] < 35, "character_grade"] = "F"
    
    # Return the Mega Report DataFrame
    return mega_report_df

In [7]:
main_report = get_report_df(report_database)
main_report

,student_name,math_scores,chemistry_scores,information_technology_scores,physics_scores,student_email,class,division,teacher,total_score,average_score,status,character_grade
0,Jay,20,32,34,6,Jay@gmail.com,10,A,Zoshua Colah,92,23.00,fail,F
1,Aaryan,56,36,6,88,Aaryan@gmail.com,10,A,Zoshua Colah,186,46.50,pass,D
2,Sahil,76,78,88,48,Sahil@gmail.com,10,A,Zoshua Colah,290,72.50,pass,B
3,Riya,78,23,100,90,Riya@gmail.com,10,A,Zoshua Colah,291,72.75,pass,B
4,Shubh,90,100,45,25,Shubh@gmail.com,10,A,Zoshua Colah,260,65.00,pass,C
5,Jai,32,32,34,6,Jai@gmail.com,10,B,Aayushi Shah,104,26.00,fail,F
6,Aryan,56,56,6,88,Aryan@gmail.com,10,B,Aayushi Shah,206,51.50,pass,C
7,Firoz,76,75,48,58,Firoz@gmail.com,10,B,Aayushi Shah,257,64.25,pass,C
8,Steve,78,23,100,90,Steve@gmail.com,10,B,Aayushi Shah,291,72.75,pass,B
9,Rhea,90,10,45,25,Rhea@gmail.com,10,B,Aayushi Shah,170,42.50,pass,D
10,Kareena,22,30,34,60,Kareena@gmail.com,10,C,Rahul Joy,146,36.50,pass,D
11,Alia,56,56,6,88,Alia@gmail.com,10,C,Rahul Joy,206,51.50,pass,C
12,Priyanka,76,78,98,58,Priyanka@gmail.com,10,C,Rahul Joy,310,77.50,pass,B
13,Shahrukh,78,23,100,90,Shahrukh@gmail.com,10,C,Rahul Joy,291,72.75,pass,B
14,Salman,90,100,40,25,Salman@gmail.com,10,C,Rahul Joy,255,63.75,pass,C

# We want to know how many students passed and how many students failed in each division?

In [8]:
pass_fail_df = main_report.groupby(["division", "status"]).agg(total_students = ("status", "count"))
pass_fail_df

                 total_students
division status
A        fail                 1
         pass                 4
B        fail                 1
         pass                 4
C        pass                 5

# we want to know what is the mean total score by division ?

In [9]:
mean_total_score_df = main_report.groupby(["division"]).agg(mean_total_score = ("total_score", "mean"))
mean_total_score_df

          mean_total_score
division
A                    223.8
B                    205.6
C                    241.6

# we want to know what is the lowest physics score by division ?

In [10]:
min_total_score_df = main_report.groupby(["division"]).agg(lowest_physics_score = ("physics_scores", "min"))
min_total_score_df

          lowest_physics_score
division
A                            6
B                            6
C                           25

# we want to know what is the highest physics score by the division ?

In [11]:
max_total_score_df = main_report.groupby(["division"]).agg(highest_physics_score = ("physics_scores", "max"))
max_total_score_df

          highest_physics_score
division
A                            90
B                            90
C                            90

# challenge : we want to know the total students by character grade and division ?

In [12]:
grade_div_df = main_report.groupby(["character_grade", "division"]).agg(total_studentd = ("character_grade", "count"))
grade_div_df

                          total_studentd
character_grade division
B               A                      2
                B                      1
                C                      2
C               A                      1
                B                      2
                C                      2
D               A                      1
                B                      1
                C                      1
F               A                      1
                B                      1

# we want to know the average math score, physics score , chemistry score by division

In [13]:
pcm_avg_df = main_report.groupby(["division"]).agg(avg_math_score = ("math_scores", "mean"),
                                          avg_physics_score = ("physics_scores", "mean"),
                                          avg_chemistry_score = ("chemistry_scores", "mean"))
pcm_avg_df

          avg_math_score  avg_physics_score  avg_chemistry_score
division
A                   64.0               51.4                 53.8
B                   66.4               53.4                 39.2
C                   64.4               64.2                 57.4

# we want to see a report card only with the students who have total_score equal to or above 250

In [14]:
top_students_df = main_report.loc[main_report["total_score"] >= 250]
top_students_df

,student_name,math_scores,chemistry_scores,information_technology_scores,physics_scores,student_email,class,division,teacher,total_score,average_score,status,character_grade
2,Sahil,76,78,88,48,Sahil@gmail.com,10,A,Zoshua Colah,290,72.50,pass,B
3,Riya,78,23,100,90,Riya@gmail.com,10,A,Zoshua Colah,291,72.75,pass,B
4,Shubh,90,100,45,25,Shubh@gmail.com,10,A,Zoshua Colah,260,65.00,pass,C
7,Firoz,76,75,48,58,Firoz@gmail.com,10,B,Aayushi Shah,257,64.25,pass,C
8,Steve,78,23,100,90,Steve@gmail.com,10,B,Aayushi Shah,291,72.75,pass,B
12,Priyanka,76,78,98,58,Priyanka@gmail.com,10,C,Rahul Joy,310,77.50,pass,B
13,Shahrukh,78,23,100,90,Shahrukh@gmail.com,10,C,Rahul Joy,291,72.75,pass,B
14,Salman,90,100,40,25,Salman@gmail.com,10,C,Rahul Joy,255,63.75,pass,C

# we want to see a report card only with students who failed

In [15]:
failed_df = main_report.loc[main_report["status"] == "fail"].reset_index()
failed_df

,index,student_name,math_scores,chemistry_scores,information_technology_scores,physics_scores,student_email,class,division,teacher,total_score,average_score,status,character_grade
0,0,Jay,20,32,34,6,Jay@gmail.com,10,A,Zoshua Colah,92,23.0,fail,F
1,5,Jai,32,32,34,6,Jai@gmail.com,10,B,Aayushi Shah,104,26.0,fail,F

# we want to see a report with students:
 - only from B division 
 - total_score equal to or above 250

In [16]:
b_250_df = main_report.loc[(main_report["division"] == "B") & (main_report["total_score"] >= 250)]
b_250_df

,student_name,math_scores,chemistry_scores,information_technology_scores,physics_scores,student_email,class,division,teacher,total_score,average_score,status,character_grade
7,Firoz,76,75,48,58,Firoz@gmail.com,10,B,Aayushi Shah,257,64.25,pass,C
8,Steve,78,23,100,90,Steve@gmail.com,10,B,Aayushi Shah,291,72.75,pass,B

# we want to see a report with student :
- from B or C

In [17]:
b_c_df = main_report.loc[(main_report["division"] == "B") | (main_report["division"] == "c")]
b_c_df

,student_name,math_scores,chemistry_scores,information_technology_scores,physics_scores,student_email,class,division,teacher,total_score,average_score,status,character_grade
5,Jai,32,32,34,6,Jai@gmail.com,10,B,Aayushi Shah,104,26.00,fail,F
6,Aryan,56,56,6,88,Aryan@gmail.com,10,B,Aayushi Shah,206,51.50,pass,C
7,Firoz,76,75,48,58,Firoz@gmail.com,10,B,Aayushi Shah,257,64.25,pass,C
8,Steve,78,23,100,90,Steve@gmail.com,10,B,Aayushi Shah,291,72.75,pass,B
9,Rhea,90,10,45,25,Rhea@gmail.com,10,B,Aayushi Shah,170,42.50,pass,D

# the school desires a report on:
- Aayushi shah(teacher) Zoshua colah (teacher)
- what is the minimum math score, max physics score , mean chemistry score

In [18]:
teacher_df = main_report.loc[(main_report["teacher"] == "Aayushi shah") | (main_report["teacher"] == "zoshua colah")]
teacher_df

Empty DataFrame
Columns: [student_name, math_scores, chemistry_scores, information_technology_scores, physics_scores, student_email, class, division, teacher, total_score, average_score, status, character_grade]
Index: []

In [19]:
teacher_stats_df = teacher_df.groupby(["teacher"]).agg(min_math_score = ("math_scores", "min"),
                                                      max_physics_score = ("physics_scores", "max"),
                                                      mean_chemistry_score = ("chemistry_scores", "mean"))
teacher_stats_df

Empty DataFrame
Columns: [min_math_score, max_physics_score, mean_chemistry_score]
Index: []

In [20]:
melted_df = pd.melt(main_report, id_vars = ["student_name", "division", "teacher"], value_vars = ["math_scores", "physics_scores"])
melted_df

   student_name division       teacher        variable  value
0           Jay        A  Zoshua Colah     math_scores     20
1        Aaryan        A  Zoshua Colah     math_scores     56
2         Sahil        A  Zoshua Colah     math_scores     76
3          Riya        A  Zoshua Colah     math_scores     78
4         Shubh        A  Zoshua Colah     math_scores     90
5           Jai        B  Aayushi Shah     math_scores     32
6         Aryan        B  Aayushi Shah     math_scores     56
7         Firoz        B  Aayushi Shah     math_scores     76
8         Steve        B  Aayushi Shah     math_scores     78
9          Rhea        B  Aayushi Shah     math_scores     90
10      Kareena        C     Rahul Joy     math_scores     22
11         Alia        C     Rahul Joy     math_scores     56
12     Priyanka        C     Rahul Joy     math_scores     76
13     Shahrukh        C     Rahul Joy     math_scores     78
14       Salman        C     Rahul Joy     math_scores     90
15          Jay        A  Zoshua Colah  physics_scores      6
16       Aaryan        A  Zoshua Colah  physics_scores     88
17        Sahil        A  Zoshua Colah  physics_scores     48
18         Riya        A  Zoshua Colah  physics_scores     90
19        Shubh        A  Zoshua Colah  physics_scores     25
20          Jai        B  Aayushi Shah  physics_scores      6
21        Aryan        B  Aayushi Shah  physics_scores     88
22        Firoz        B  Aayushi Shah  physics_scores     58
23        Steve        B  Aayushi Shah  physics_scores     90
24         Rhea        B  Aayushi Shah  physics_scores     25
25      Kareena        C     Rahul Joy  physics_scores     60
26         Alia        C     Rahul Joy  physics_scores     88
27     Priyanka        C     Rahul Joy  physics_scores     58
28     Shahrukh        C     Rahul Joy  physics_scores     90
29       Salman        C     Rahul Joy  physics_scores     25